interface FAQ {
  question: string;
  answer: string;
}

const faqs: FAQ[] = [
  {
    question: "สามารถเปลี่ยนชนิดดอกไม้และสีกระดาษหรือสีของดอกไม้ได้หรือไม่",
    answer: "สินค้าทางร้านสามารถเปลี่ยนสีชนิดตามความต้องการของลูกค้าได้"
  },
  {
    question: "ต้องสั่งขั้นต่ำเท่าไหร่จึงได้รับบริการส่งฟรี",
    answer: "สินค้าทุกรายการจัดส่งฟรีในพื้นที่ๆระบุไว้ (เมืองภูเก็ต) โดยไม่มีขั้นต่ำในการสั่งซื้อ หากอยู่นอกเขตพื้นที่อาจมีค่าส่งเพิ่มเติมนอกเขต",
  },
  {
    question: "ชำระเงินด้วยเงินสดได้หรือไม่",
    answer: "ทางร้านขออภัยในความไม่สะดวกแต่ร้านรับชำระเงินผ่ารการโอนเงินโดยทางร้านจัดทำสินค้าหลังจากได้รับการแจ้งชำระเงินแล้วเท่านั้น",
  },
  {
    question: "วิธีดูแลแจกันดอกไม้",
    answer: `
      <ul style="padding-left: 1.5rem;">
        <li style="list-style: disc;">ไม่วางโดนแดด</li>
        <li style="list-style: disc;">หมั่นเล็มก้านและเปลี่ยนน้ำทุกวัน</li>
        <li style="list-style: disc;">ดอกไม้ก้านแข็ง เช่น กุหลาบ ไฮเดรนเยีย ให้ตัดก้านแนวเฉียงเพื่อเพิ่มพื้นที่ในการดูดน้ำ</li>
        <li style="list-style: disc;">ดอกไม้ก้านโปร่งอ่อน เช่น เยอบีร่า ทิวลิป ให้ตัดขนานตรง เนื่องจากก้านจะเปื่อยได้ง่าย</li>
        <li style="list-style: disc;">สามารถใส่แอสไพริน หรือ อาหารดอกไม้ลงไปในน้ำได้ จะช่วยฆ่าเชื้อทำให้น้ำสะอาดนานขึ้น</li>
      </ul>
    `
  },
  {
    question: "วิธีดูแลช่อดอกไม้",
    answer: `
      <ul style="padding-left: 1.5rem;">
        <li style="list-style: disc;">หากต้องการให้ดอกไม้สดนาน ให้นำออกจากช่อ แล้วเล็มก้านเล็กน้อย ใส่แจกันซึ่งเติมน้ำสะอาดไว้ หลังจากนั้น ดูแลเหมือนแจกันดอกไม้ได้เลย</li>
        <li style="list-style: disc;">หากต้องการเก็บทั้งช่อ เมื่อผ่านไปสองสามวัน ให้นำสำลีที่หุ้มก้านด้านล่างออก แล้วนำช่อแขวนกลับหัวลงในที่มีอากาศถ่ายเท แต่ไม่โดนแดด</li>
        <li style="list-style: disc;">ไม่ควรเก็บทั้งช่อไว้ในที่ปิด เนื่องจากอาจขึ้นราได้</li>
      </ul>
    `
  },
  {
    question: "วิธีดูแลดอกไม้ประดิษฐ์ทำอย่างไร",
    answer: `
      <ul style="padding-left: 1.5rem;">
        <li style="list-style: disc;">วางในที่ร่ม ไม่โดนแดด เนื่องจากสีอาจซีดจางหากโดนแดดเป็นเวลานาน</li>
        <li style="list-style: disc;">ทำความสะอาดโดยการใช้แปรงปัดฝุ่นอย่างสม่ำเสมอ หรืออาจใช้ไดร์เป่าผมในโหมดเย็น เพื่อเป่าฝุ่นออกก็ได้</li>
        <li style="list-style: disc;">ใช้ผ้าแห้งเช็ดฝุ่นออกทุก ๆ สองสามเดือน เนื่องจากการเป่าหรือการใช้แปรง อาจกำจัดฝุ่นได้ไม่หมด</li>
        <li style="list-style: disc;">หลีกเลี่ยงน้ำและความร้อน เนื่องจากดอกไม้ประดิษฐ์มีส่วนประกอบที่เป็นกาว หากนำไปล้าง หรือ เป่าด้วยความร้อน อาจทำให้กาวเสื่อมสภาพได้</li>
      </ul>
    `
  },
  {
    question: "ใช้เวลาจัดส่งสินค้าเร็วที่สุดเท่าไหร่",
    answer: "ทางร้านสามารถจัดส่งได้เร็วที่สุดภายใน 2-4 ชั่วโมง",
  },
];

export default { faqs };
